/*
	напишите программу для вывода значения константы EOF
*/

#include <stdio.h>

int main()
{
    printf("%d", EOF);
    return 0;
}
